Rasket/app/Controllers/Alumnos.php

SELECT *
FROM `grados`
ORDER BY `id_grado` ASC
---
    private function _cargarFormulario($titulo, $estatus)
    {
        $gradoModel = new GradoModel();
        $cicloModel = new CicloEscolarModel();
        $userModel  = new UserModel();

        $prediccion = $userModel->generarProximaMatricula();

        $data = [
            'title'             => $titulo,
            'estatus_form'      => $estatus,
            'grados'            => $gradoModel->orderBy('id_grado', 'ASC')->asArray()->findAll(),
            'ciclos'            => $cicloModel->orderBy('nombreCicloEscolar', 'ASC')->asArray()->findAll(),
            'proxima_matricula' => $prediccion
        ];