Rasket/app/Controllers/Calificaciones.php

SELECT `nivel_grado`
FROM `grados`
WHERE `id_grado` = '28'
---
            }

            // Consultamos la configuración global como respaldo
            $gradoInfo = $model->db->table('grados')->select('nivel_grado')->where('id_grado', $id_grado)->get()->getRow();

SELECT `nivel_grado`
FROM `grados`
WHERE `id_grado` = '28'
---
                fclose($handle);

                // Consultamos el nivel del grado para saber en qué tabla buscar el nombre del mes
                $gradoInfo = $model->db->table('grados')->select('nivel_grado')->where('id_grado', $id_grado_esperado)->get()->getRow();