Rasket/app/Models/BoletaModel.php

    public function getInfoGrado($id_grado) {
        return $this->db->table('grados')
            ->select('id_grado, nombreGrado, nivel_grado, boleta_config, boleta_ing_config') // Agregamos los campos JSON
            ->where('id_grado', $id_grado)
            ->get()->getRowArray();
---
SELECT `id_grado`, `nombreGrado`, `nivel_grado`, `boleta_config`, `boleta_ing_config`
FROM `grados`
WHERE `id_grado` = '22'

    public function getDatosAlumno($id_usuario)
    {
        return $this->db->table('usr')
            ->select('usr.id, usr.Nombre, usr.ap_Alumno, usr.am_Alumno, usr.matricula, grados.nombreGrado')
            ->join('grados', 'usr.grado = grados.id_grado')
            ->where('usr.id', $id_usuario)
            ->get()->getRowArray();
---
SELECT `usr`.`id`, `usr`.`Nombre`, `usr`.`ap_Alumno`, `usr`.`am_Alumno`, `usr`.`matricula`, `grados`.`nombreGrado`
FROM `usr`
JOIN `grados` ON `usr`.`grado` = `grados`.`id_grado`
WHERE `usr`.`id` = '1847'

    public function getAlumnosPorGrado($id_grado)
    {
        return $this->db->table('usr')
            ->select('id, generacionactiva, matricula, Nombre, ap_Alumno, am_Alumno, email, activo')
            ->where('grado', $id_grado)
            ->where('activo', 1)
            ->where('generacionactiva', 11)
            ->orderBy('ap_Alumno', 'ASC')
            ->get()->getResultArray();
---
SELECT `id`, `generacionactiva`, `matricula`, `Nombre`, `ap_Alumno`, `am_Alumno`, `email`, `activo`
FROM `usr`
WHERE `grado` = '22'
AND `activo` = 1
AND `generacionactiva` = 11
ORDER BY `ap_Alumno` ASC

    public function getMaterias($id_grado)
    {
        return $this->db->table('materia')
            ->select('id_materia, nombre_materia, GrupoMat')
            ->where('id_grados', $id_grado)
            ->orderBy('orden', 'ASC')
            ->get()->getResultArray();
---
SELECT `id_materia`, `nombre_materia`, `GrupoMat`
FROM `materia`
WHERE `id_grados` = '22'
ORDER BY `orden` ASC

    public function getCalificaciones($id_usuario, $id_grado, $id_ciclo)
    {
        $rows = $this->db->table('calificacion')
            ->select('id_materia, id_mes, calificacion, cicloEscolar')
            ->where('id_usr', $id_usuario)
            ->where('id_grado', $id_grado)
            ->where('cicloEscolar', $id_ciclo)
            ->get()->getResultArray();
---
SELECT `id_materia`, `id_mes`, `calificacion`, `cicloEscolar`
FROM `calificacion`
WHERE `id_usr` = '1847'
AND `id_grado` = '22'
AND `cicloEscolar` = '11'