Rasket/app/Models/CalificacionesModel.php

    public function getConfiguracionActiva($nivel_grado)
    {
        // ID 1 = Primaria/Secundaria | ID 2 = Bachillerato | ID 3 = Kinder
        $id_config = 1;
        if ($nivel_grado == 5) { $id_config = 2; }
        elseif ($nivel_grado <= 2) { $id_config = 3; }

        $builder = $this->db->table('mesycicloactivo MA');
        $builder->select('MA.id_mes, MA.id_ciclo, M.nombre as nombre_mes, CE.nombreCicloEscolar');
        $builder->join('mes M', 'MA.id_mes = M.id');
        $builder->join('cicloescolar CE', 'MA.id_ciclo = CE.id_cicloEscolar');
        $builder->where('MA.id', $id_config);

        return $builder->get()->getRowArray();
---
SELECT `MA`.`id_mes`, `MA`.`id_ciclo`, `M`.`nombre` as `nombre_mes`, `CE`.`nombreCicloEscolar`
FROM `mesycicloactivo` `MA`
JOIN `mes` `M` ON `MA`.`id_mes` = `M`.`id`
JOIN `cicloescolar` `CE` ON `MA`.`id_ciclo` = `CE`.`id_cicloEscolar`
WHERE `MA`.`id` = 1

    public function getSabana($id_grado)
    {
        // A. Obtener Info del Grado y su Configuración JSON
        $grado = $this->db->table('grados')
            ->select('id_grado, nombreGrado, nivel_grado, sabana_calif_config')
            ->where('id_grado', $id_grado)
            ->get()->getRowArray();

        if (!$grado) return null;

        // Se decodifica el JSON
        $configJson = json_decode($grado['sabana_calif_config'] ?? '{"groups":[]}', true);

        // Obtenemos qué Mes y Ciclo están abiertos para captura
        $activeConfig = $this->getConfiguracionActiva($grado['nivel_grado']);

        // B. Obtener Catálogo de Materias (ID => Nombre)
        // Esto sirve para pintar los encabezados de las columnas
        $materiasRaw = $this->db->table('materia')
            ->select('id_materia, nombre_materia')
            ->where('id_grados', $id_grado)
            ->orderBy('orden', 'ASC')
            ->get()->getResultArray();
---
SELECT `id_grado`, `nombreGrado`, `nivel_grado`, `sabana_calif_config`
FROM `grados`
WHERE `id_grado` = '37'
SELECT `id_materia`, `nombre_materia`
FROM `materia`
WHERE `id_grados` = '37'
ORDER BY `orden` ASC

    public function updateCalificacion($id_cal, $tipo, $valor, $nivel_usuario)
    {
        // Calculamos la "Bandera" de seguridad basada en el nivel de usuario
        // 9=Profesor, 2=Director, 1=Admin
        $bandera = 0;
        if ($nivel_usuario == 9) $bandera = 1;
        elseif ($nivel_usuario == 2) $bandera = 2;
        elseif ($nivel_usuario == 1) $bandera = 100;

        $data = [];

        // Caso 1: Editar Calificación
        if ($tipo === 'score') {
            $data = [
                'calificacion'  => $valor,
                'fechaInsertar' => date('Y-m-d H:i:s'),
                'bandera'       => $bandera
            ];
        }
        // Caso 2: Editar Faltas
        elseif ($tipo === 'absence') {
            $data = [
                'faltas' => $valor
                // Nota: Las faltas usualmente no cambian la bandera ni fecha, pero se puede agregar si quieres
            ];
        }

        // Ejecutamos la actualización segura usando el ID de la calificación
        return $this->update($id_cal, $data);
---
UPDATE `calificacion` SET `calificacion` = '10', `fechaInsertar` = '2026-01-15 05:14:53', `bandera` = '1'
WHERE `calificacion`.`Id_cal` IN ('903803')