Rasket/app/Models/CalificacionesBimestreModel.php

    public function guardarCalificacion($id_usr, $id_grado, $id_materia, $id_mes, $val, $id_capturista, $id_ciclo)
    {
        $existe = $this->where([
            'id_usr'       => $id_usr,
            'id_materia'   => $id_materia,
            'id_mes'       => $id_mes,
            'cicloEscolar' => $id_ciclo
        ])->first();

        $datos = [
            'calificacion'  => $val,
            'fechaInsertar' => date('Y-m-d H:i:s'), // Capturo el momento exacto
            'bandera'       => $id_capturista
        ];

        if ($existe) {
            return $this->update($existe['Id_cal'], $datos);
---
SELECT *
FROM `calificacion`
WHERE `id_usr` = '1883'
AND `id_materia` = '1'
AND `id_mes` = '8'
AND `cicloEscolar` = '11'
 LIMIT 1
UPDATE `calificacion` SET `calificacion` = '7', `fechaInsertar` = '2026-01-15 05:14:21', `bandera` = '1'
WHERE `calificacion`.`Id_cal` IN ('903793')