Rasket/app/Models/CalificacionesModel.php

SELECT `MA`.`id_mes`, `MA`.`id_ciclo`, `CE`.`nombreCicloEscolar`
FROM `mesycicloactivo` `MA`
JOIN `cicloescolar` `CE` ON `MA`.`id_ciclo` = `CE`.`id_cicloEscolar`
WHERE `MA`.`id` = 3
---
    public function getConfiguracionActiva($nivel_grado)
    {
        // ID 1 = Primaria/Secundaria | ID 2 = Bachillerato | ID 3 = Kinder
        $id_config = 1;
        if ($nivel_grado == 5) { $id_config = 2; }
        elseif ($nivel_grado <= 2) { $id_config = 3; }

        // 1. Obtenemos qué ID de mes/periodo está activo en la tabla de control
        $builder = $this->db->table('mesycicloactivo MA');
        $builder->select('MA.id_mes, MA.id_ciclo, CE.nombreCicloEscolar');
        $builder->join('cicloescolar CE', 'MA.id_ciclo = CE.id_cicloEscolar');
        $builder->where('MA.id', $id_config);

        $data = $builder->get()->getRowArray();

SELECT `id_grado`, `nombreGrado`, `nivel_grado`, `sabana_calif_config`
FROM `grados`
WHERE `id_grado` = '22'
---
    public function getSabana($id_grado, $mes_custom = null)
    {
        // A. Obtener Info del Grado y su Configuración JSON
        $grado = $this->db->table('grados')
            ->select('id_grado, nombreGrado, nivel_grado, sabana_calif_config')
            ->where('id_grado', $id_grado)
            ->get()->getRowArray();

SELECT `id_materia`, `nombre_materia`
FROM `materia`
WHERE `id_grados` = '22'
ORDER BY `orden` ASC
---

        // ---------------------------------------------------------------------
        // B. Obtener Catálogo de Materias
        $materiasRaw = $this->db->table('materia')
            ->select('id_materia, nombre_materia')
            ->where('id_grados', $id_grado)
            ->orderBy('orden', 'ASC')
            ->get()->getResultArray();

INSERT INTO `calificacion` (`id_usr`, `id_materia`, `id_grado`, `cicloEscolar`, `id_mes`, `fechaInsertar`, `bandera`, `calificacion`, `faltas`) VALUES ('1937', '214', '28', '11', '4', '2026-02-28 20:04:01', '1', '9', 0)
---
    public function crearCalificacion($datos)
    {
        $this->insert($datos);