Rasket/app/Models/CambioGradoModel.php

    public function getAlumnos($busqueda = null, $porPagina = 20)
    {
        $builder = $this->select('usr.*, grados.nombreGrado, estatus_usr.nombre as nombre_estatus')
                        ->join('grados', 'usr.grado = grados.Id_grado', 'left')
                        ->join('estatus_usr', 'usr.estatus = estatus_usr.Id', 'left')
                        ->where('usr.nivel', 7)
                        ->where('usr.activo', 1);

        if (!empty($busqueda)) {
            $builder->groupStart()
                    ->like('usr.Nombre', $busqueda)
                    ->orLike('usr.ap_Alumno', $busqueda)
                    ->orLike('usr.am_Alumno', $busqueda)
                    ->orLike('usr.email', $busqueda)
                    ->groupEnd();
        }
        $builder->orderBy('usr.ap_Alumno', 'ASC');
        return $this->paginate($porPagina);
---
SELECT COUNT(*) AS `numrows`
FROM `usr`
LEFT JOIN `grados` ON `usr`.`grado` = `grados`.`Id_grado`
LEFT JOIN `estatus_usr` ON `usr`.`estatus` = `estatus_usr`.`Id`
WHERE `usr`.`nivel` = 7
AND `usr`.`activo` = 1
SELECT `usr`.*, `grados`.`nombreGrado`, `estatus_usr`.`nombre` as `nombre_estatus`
FROM `usr`
LEFT JOIN `grados` ON `usr`.`grado` = `grados`.`Id_grado`
LEFT JOIN `estatus_usr` ON `usr`.`estatus` = `estatus_usr`.`Id`
WHERE `usr`.`nivel` = 7
AND `usr`.`activo` = 1
ORDER BY `usr`.`ap_Alumno` ASC
 LIMIT 30

    public function getListaGrados()
    {
        $db = \Config\Database::connect();
        return $db->table('grados')->orderBy('id_grado', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `grados`
ORDER BY `id_grado` ASC