Rasket/app/Models/PagoModel.php

SELECT COUNT(*) AS `numrows`
FROM `pago`
JOIN `usr` `u` ON `pago`.`id_usr` = `u`.`id`
LEFT JOIN `grados` `g` ON `u`.`grado` = `g`.`Id_grado`
WHERE `u`.`nivel` = 7
AND `u`.`estatus` = 2
AND `pago`.`validar_ficha` = 48
---
    public function getPagosPendientes($busqueda = null, $perPage = 10)
    {
        $builder = $this->select('pago.*, u.Nombre, u.ap_Alumno, u.am_Alumno, u.email, g.nombreGrado')
                        ->join('usr u', 'pago.id_usr = u.id')
                        ->join('grados g', 'u.grado = g.Id_grado', 'left')
                        ->where('u.nivel', 7)
                        ->where('u.estatus', 2)
                        // USAMOS 48 PORQUE ASÍ LO REQUIERE TU DB (Valor ASCII de '0')
                        ->where('pago.validar_ficha', 48);

        // LÓGICA DE BÚSQUEDA
        if (!empty($busqueda)) {
            $builder->groupStart(); // IMPORTANTE: Abrir paréntesis para que el filtro 48 no se rompa

                // 1. Búsqueda individual
                $builder->like('u.Nombre', $busqueda)
                        ->orLike('u.ap_Alumno', $busqueda)
                        ->orLike('u.am_Alumno', $busqueda)
                        ->orLike('u.email', $busqueda);

                // 2. Búsqueda compuesta (Nombre + Apellidos)
                // CONCAT_WS ignora los nulos y une con espacios
                $nombresCompletos = "CONCAT_WS(' ', u.Nombre, u.ap_Alumno, u.am_Alumno)";
                $builder->orWhere("$nombresCompletos LIKE '%" . $this->db->escapeLikeString($busqueda) . "%'");

            $builder->groupEnd(); // Cerrar paréntesis
        }

        $builder->orderBy('pago.fechaEnvio', 'DESC');

        return $this->paginate($perPage);