Rasket/app/Models/ProfesorModel.php

    public function getProfesoresActivos()
    {
        return $this->select('usr.*, estatus_usr.nombre AS nombre_nivel')
                    ->join('estatus_usr', 'usr.estatus = estatus_usr.Id')
                    ->where('usr.nivel', 5)
                    ->where('usr.estatus', 1)
                    ->findAll();
---
SELECT `usr`.*, `estatus_usr`.`nombre` AS `nombre_nivel`
FROM `usr`
JOIN `estatus_usr` ON `usr`.`estatus` = `estatus_usr`.`Id`
WHERE `usr`.`nivel` = 5
AND `usr`.`estatus` = 1

    public function tieneMaterias($idProfesor)
    {
        return $this->db->table('materia_Asignada')
            ->where('id_usr', $idProfesor)
            ->where('activo', 1)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `materia_Asignada`
WHERE `id_usr` = '939'
AND `activo` = 1