Rasket/app/Views/partials/main-nav.php


                if ($idGradoT) {
                    $db = \Config\Database::connect();
                    $rowG = $db->table('grados')->select('nombreGrado')->where('id_grado', $idGradoT)->get()->getRow();
---
SELECT `nombreGrado`
FROM `grados`
WHERE `id_grado` = '22'