Rasket/app/Controllers/Titular/DashboardTitular.php

SELECT *
FROM `grados`
WHERE `Id_grado` = '22'
---
    public function index()
    {
        $session = session();

        if (!$session->has('id') || $session->get('nivel') != 9) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();
        $idUsuario = $session->get('id');

        // 1. Obtener el grupo asignado
        $idGradoTitular = $session->get('nivelT');
        $nombreGrupo = 'Grupo no asignado';

        if (!empty($idGradoTitular)) {
            $gradoRow = $db->table('grados')
                           ->where('Id_grado', $idGradoTitular)
                           ->get()
                           ->getRowArray();

SELECT *
FROM `cicloEscolar`
WHERE `Id_cicloEscolar` = '11'
---
        $nombreCiclo = 'No definido';

        if (!empty($config['id_ciclo'])) {
            $cicloRow = $db->table('cicloEscolar')
                           ->where('Id_cicloEscolar', $config['id_ciclo'])
                           ->get()
                           ->getRowArray();

SELECT `pass`
FROM `usr`
WHERE `id` = '918'
---
        }

        // 3. Obtener la contraseña actual
        $usuario = $db->table('usr')
                      ->select('pass')
                      ->where('id', $idUsuario)
                      ->get()
                      ->getRowArray();