Rasket/app/Controllers/Titular/SabanaController.php

SELECT `nivel_grado`, `nombreGrado`
FROM `grados`
WHERE `id_grado` = '31'
---
    public function index()
    {
        $session = session();
        $db = \Config\Database::connect();

        // 1. Obtener datos del grupo titular desde la sesión
        $idGrado = $session->get('nivelT'); // ID del grado (ej: 21)

        // 2. Consultar qué NIVEL EDUCATIVO es ese grado
        // (Esto es vital para saber si mostramos Meses, Bimestres o Evaluaciones)
        $gradoInfo = $db->table('grados')
                        ->select('nivel_grado, nombreGrado')
                        ->where('id_grado', $idGrado)
                        ->get()->getRow();

SELECT `id`, `nombre`
FROM `bimestres`
---

            case 5: // BACHILLERATO (Tabla 'bimestres')
                $tituloPeriodo = "Bimestres";
                $periodos = $db->table('bimestres')
                               ->select('id, nombre')
                               ->get()->getResultArray();