Rasket/app/Controllers/Admin/DashboardAdmin.php

    public function index()
    {
        $session = session();
        $nivel = $session->get('nivel');
        $idUsuario = $session->get('id');

        if (!$session->has('id') || $nivel != 1) {
            return redirect()->to(base_url('dashboard'));
        }

        $db = \Config\Database::connect();

        $califModel = new CalificacionesModel();
        $config = $califModel->getConfiguracionActiva(1);
        $nombreCiclo = 'No definido';
        if (!empty($config['id_ciclo'])) {
            $ciclo = $db->table('cicloEscolar')->where('Id_cicloEscolar', $config['id_ciclo'])->get()->getRow();
            $nombreCiclo = $ciclo ? $ciclo->nombreCicloEscolar : 'No definido';
        }


        $usuario = $db->table('usr')->select('pass')->where('id', $idUsuario)->get()->getRowArray();
        $passwordReal = $usuario ? $usuario['pass'] : '';

        $grados = $db->table('grados')->orderBy('nivel_grado', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `cicloEscolar`
WHERE `Id_cicloEscolar` = '11'
SELECT `pass`
FROM `usr`
WHERE `id` = '1'
SELECT *
FROM `grados`
ORDER BY `nivel_grado` ASC